---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings
source: html/c1b815c3-46f6-5d09-b09c-e28a183d8a01.htm
---
# AnalysisDisplayLegendSettings Members

Constructs a default instance of legend settings.